GopalSaraf/Practicals/PSDL/include/proc/pic16f15225.h
// Register: ADACT
#define ADACT ADACT
extern volatile unsigned char           ADACT               __at(0x09F);
#ifndef _LIB_BUILD
asm("ADACT equ 09Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACT                    :4;
    };
    struct {
        unsigned ADACT                  :4;
    };
} ADACTbits_t;
extern volatile ADACTbits_t ADACTbits __at(0x09F);
// bitfield macros
#define _ADACT_ACT_POSN                                     0x0
#define _ADACT_ACT_POSITION                                 0x0
#define _ADACT_ACT_SIZE                                     0x4
#define _ADACT_ACT_LENGTH                                   0x4
#define _ADACT_ACT_MASK                                     0xF
#define _ADACT_ADACT_POSN                                   0x0
#define _ADACT_ADACT_POSITION                               0x0
#define _ADACT_ADACT_SIZE                                   0x4
#define _ADACT_ADACT_LENGTH                                 0x4
#define _ADACT_ADACT_MASK                                   0xF

// Register: RC0I2C
#define RC0I2C RC0I2C
extern volatile unsigned char           RC0I2C              __at(0x10E);
#ifndef _LIB_BUILD
asm("RC0I2C equ 010Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
} RC0I2Cbits_t;
extern volatile RC0I2Cbits_t RC0I2Cbits __at(0x10E);
// bitfield macros
#define _RC0I2C_TH_POSN                                     0x0
#define _RC0I2C_TH_POSITION                                 0x0
#define _RC0I2C_TH_SIZE                                     0x2
#define _RC0I2C_TH_LENGTH                                   0x2
#define _RC0I2C_TH_MASK                                     0x3
#define _RC0I2C_PU_POSN                                     0x4
#define _RC0I2C_PU_POSITION                                 0x4
#define _RC0I2C_PU_SIZE                                     0x2
#define _RC0I2C_PU_LENGTH                                   0x2
#define _RC0I2C_PU_MASK                                     0x30
#define _RC0I2C_SLEW_POSN                                   0x6
#define _RC0I2C_SLEW_POSITION                               0x6
#define _RC0I2C_SLEW_SIZE                                   0x1
#define _RC0I2C_SLEW_LENGTH                                 0x1
#define _RC0I2C_SLEW_MASK                                   0x40

// Register: RC1I2C
#define RC1I2C RC1I2C
extern volatile unsigned char           RC1I2C              __at(0x10F);
#ifndef _LIB_BUILD
asm("RC1I2C equ 010Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
} RC1I2Cbits_t;
extern volatile RC1I2Cbits_t RC1I2Cbits __at(0x10F);
// bitfield macros
#define _RC1I2C_TH_POSN                                     0x0
#define _RC1I2C_TH_POSITION                                 0x0
#define _RC1I2C_TH_SIZE                                     0x2
#define _RC1I2C_TH_LENGTH                                   0x2
#define _RC1I2C_TH_MASK                                     0x3
#define _RC1I2C_PU_POSN                                     0x4
#define _RC1I2C_PU_POSITION                                 0x4
#define _RC1I2C_PU_SIZE                                     0x2
#define _RC1I2C_PU_LENGTH                                   0x2
#define _RC1I2C_PU_MASK                                     0x30
#define _RC1I2C_SLEW_POSN                                   0x6
#define _RC1I2C_SLEW_POSITION                               0x6
#define _RC1I2C_SLEW_SIZE                                   0x1
#define _RC1I2C_SLEW_LENGTH                                 0x1
#define _RC1I2C_SLEW_MASK                                   0x40

// Register: RC1REG
#define RC1REG RC1REG
extern volatile unsigned char           RC1REG              __at(0x119);
#ifndef _LIB_BUILD
asm("RC1REG equ 0119h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RCREG                  :8;
    };
} RC1REGbits_t;
extern volatile RC1REGbits_t RC1REGbits __at(0x119);
// bitfield macros
#define _RC1REG_RCREG_POSN                                  0x0
#define _RC1REG_RCREG_POSITION                              0x0
#define _RC1REG_RCREG_SIZE                                  0x8
#define _RC1REG_RCREG_LENGTH                                0x8
#define _RC1REG_RCREG_MASK                                  0xFF

// Register: TX1REG
#define TX1REG TX1REG
extern volatile unsigned char           TX1REG              __at(0x11A);
#ifndef _LIB_BUILD
asm("TX1REG equ 011Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXREG                  :8;
    };
} TX1REGbits_t;
extern volatile TX1REGbits_t TX1REGbits __at(0x11A);
// bitfield macros
#define _TX1REG_TXREG_POSN                                  0x0
#define _TX1REG_TXREG_POSITION                              0x0
#define _TX1REG_TXREG_SIZE                                  0x8
#define _TX1REG_TXREG_LENGTH                                0x8
#define _TX1REG_TXREG_MASK                                  0xFF

// Register: SP1BRG
#define SP1BRG SP1BRG
extern volatile unsigned short          SP1BRG              __at(0x11B);
#ifndef _LIB_BUILD
asm("SP1BRG equ 011Bh");
#endif

// Register: SP1BRGL
#define SP1BRGL SP1BRGL
extern volatile unsigned char           SP1BRGL             __at(0x11B);
#ifndef _LIB_BUILD
asm("SP1BRGL equ 011Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPBRGL                 :8;
    };
} SP1BRGLbits_t;
extern volatile SP1BRGLbits_t SP1BRGLbits __at(0x11B);
// bitfield macros
#define _SP1BRGL_SPBRGL_POSN                                0x0
#define _SP1BRGL_SPBRGL_POSITION                            0x0
#define _SP1BRGL_SPBRGL_SIZE                                0x8
#define _SP1BRGL_SPBRGL_LENGTH                              0x8
#define _SP1BRGL_SPBRGL_MASK                                0xFF

// Register: SP1BRGH
#define SP1BRGH SP1BRGH
extern volatile unsigned char           SP1BRGH             __at(0x11C);
#ifndef _LIB_BUILD
asm("SP1BRGH equ 011Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPBRGH                 :8;
    };
} SP1BRGHbits_t;
extern volatile SP1BRGHbits_t SP1BRGHbits __at(0x11C);
// bitfield macros
#define _SP1BRGH_SPBRGH_POSN                                0x0
#define _SP1BRGH_SPBRGH_POSITION                            0x0
#define _SP1BRGH_SPBRGH_SIZE                                0x8
#define _SP1BRGH_SPBRGH_LENGTH                              0x8
#define _SP1BRGH_SPBRGH_MASK                                0xFF

// Register: RC1STA
#define RC1STA RC1STA
extern volatile unsigned char           RC1STA              __at(0x11D);
#ifndef _LIB_BUILD
asm("RC1STA equ 011Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
} RC1STAbits_t;
